In [2]:
import pandas as pd

### Reading from a csv

In [6]:
df=pd.read_csv('demo.csv')

In [7]:
df.head()

   ID Name  Age Gender  Height  Weight  Income
0   1    A   37      M     172      72   38960
1   2    B   29      F     172      79   74863
2   3    C   41      M     166      67   77256
3   4    D   29      F     158      61   84022
4   5    E   34      M     177      70   41907

# Subsetting,slicing

How to subset a dataframe by giving a condition

Syntax for subsetting a dataframe based on a condition is :- df[ condition ]

In [9]:
df[df.Age>=30]

   ID Name  Age Gender  Height  Weight  Income
0   1    A   37      M     172      72   38960
2   3    C   41      M     166      67   77256
4   5    E   34      M     177      70   41907
5   6    F   34      F     158      79   86198
7   8    H   41      F     165      75   48630
9  10    J   45      F     178      55   19021

The condition returns a boolean variable. So df[condition] returns all the rows from dataframe where the condition is true

In [10]:
df.Age>=30

0     True
1    False
2     True
3    False
4     True
5     True
6    False
7     True
8    False
9     True
Name: Age, dtype: bool

### We can give multiple conditions while subsetting with each condition separated by either '&' or '|'.
##### Here '&' is logical AND and '|' is logical OR

In [14]:
df[(df.Age>30) & (df.Height>170)]

   ID Name  Age Gender  Height  Weight  Income
0   1    A   37      M     172      72   38960
4   5    E   34      M     177      70   41907
9  10    J   45      F     178      55   19021

### Enclose each condition within a bracket else it might throw an error

In [15]:
df[df.Age>30 & df.Height>170]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

### If we wish to select only few columns instead of the entire dataframe, then we can pass them in a list inside '[ ]'

In [16]:
df[['Age','Height','Weight']]

   Age  Height  Weight
0   37     172      72
1   29     172      79
2   41     166      67
3   29     158      61
4   34     177      70
5   34     158      79
6   21     175      69
7   41     165      75
8   25     158      90
9   45     178      55

### To reference a single column, we can even use df.column_name

In [17]:
df.Age

0    37
1    29
2    41
3    29
4    34
5    34
6    21
7    41
8    25
9    45
Name: Age, dtype: int64

### To select few columns while subsetting, we use .loc

.loc[ ] is primarily label based, but may also be used with a boolean array.

In [18]:
df.loc[df.Age>30,['Name','Age','Height']]

  Name  Age  Height
0    A   37     172
2    C   41     166
4    E   34     177
5    F   34     158
7    H   41     165
9    J   45     178

#### without .loc, it throws an error

In [19]:
df[df.Age>30,['Name','Age','Height']]

TypeError: 'Series' objects are mutable, thus they cannot be hashed

#### .iloc is used when we want to select rows/columns with integer value

In [21]:
df.iloc[2,:]

ID            3
Name          C
Age          41
Gender        M
Height      166
Weight       67
Income    77256
Name: 2, dtype: object

In [22]:
df.iloc[:,2]

0    37
1    29
2    41
3    29
4    34
5    34
6    21
7    41
8    25
9    45
Name: Age, dtype: int64

In [23]:
df.iloc[1,2]

29

There are many more ways subset/select a dataframe

In [42]:
df.iat[1,2]

29

In [45]:
df.iat[1,2]

29

In [50]:
df.at[1,'Name']

'B'

.ix selects a single row or column

In [51]:
df.ix[1]

ID            2
Name          B
Age          29
Gender        F
Height      172
Weight       79
Income    74863
Name: 1, dtype: object

In [52]:
df.ix[:,'Name']

0    A
1    B
2    C
3    D
4    E
5    F
6    G
7    H
8    I
9    J
Name: Name, dtype: object

In [53]:
df.ix[1,'Name']

'B'

In [54]:
df.ix[1:4,'Name']

1    B
2    C
3    D
4    E
Name: Name, dtype: object

### To check the data types of all columns, we use dtypes

In [32]:
df.dtypes

ID         int64
Name      object
Age        int64
Gender    object
Height    object
Weight     int64
Income     int64
dtype: object

### To change the datatype of a particular column, we use pd.to_'datatype' function of pandas

In [33]:
df.Height=pd.to_numeric(df.Height, errors='ignore')

Here, the argument errors can take 3 values. So depending on how we want to handle the non numeric values, we will assign the value to errors. Possible values are:<br>
errors='ignore'. It will ignore the non numeric entries <br>
errors='coerce'. It will coerce the non numeric values to NAN <br>
errors='raise'(default). It till raise an error that pandas cannot handle non numeric values

### Count the number of NANs all the columns

In [41]:
df.isnull().sum(axis=0)

ID        0
Name      0
Age       0
Gender    0
Height    0
Weight    0
Income    0
dtype: int64

Here, axis=0 gives the count for all columns.<br>
axis=1 will give the count for all rows

### Drop

.drop is used to drop a row/column from the dataframe

In [57]:
df.drop(['Weight'],axis=1)

   ID Name  Age Gender  Height  Income
0   1    A   37      M     172   38960
1   2    B   29      F     172   74863
2   3    C   41      M     166   77256
3   4    D   29      F     158   84022
4   5    E   34      M     177   41907
5   6    F   34      F     158   86198
6   7    G   21      M     175   89841
7   8    H   41      F     165   48630
8   9    I   25      M     158   22617
9  10    J   45      F     178   19021

In [60]:
df.drop([0,3])

   ID Name  Age Gender  Height  Weight  Income
1   2    B   29      F     172      79   74863
2   3    C   41      M     166      67   77256
4   5    E   34      M     177      70   41907
5   6    F   34      F     158      79   86198
6   7    G   21      M     175      69   89841
7   8    H   41      F     165      75   48630
8   9    I   25      M     158      90   22617
9  10    J   45      F     178      55   19021

### Sorting and ranking

.sort_index is used to sort the dataframe by index<br>
.sort_values is used to sort the dataframe by values of a particular column/ <br>
.rank is used to assign ranks to all the entries

In [63]:
df.sort_values('Age')

   ID Name  Age Gender  Height  Weight  Income
6   7    G   21      M     175      69   89841
8   9    I   25      M     158      90   22617
1   2    B   29      F     172      79   74863
3   4    D   29      F     158      61   84022
4   5    E   34      M     177      70   41907
5   6    F   34      F     158      79   86198
0   1    A   37      M     172      72   38960
2   3    C   41      M     166      67   77256
7   8    H   41      F     165      75   48630
9  10    J   45      F     178      55   19021

In [64]:
df.rank()

     ID  Name   Age  Gender  Height  Weight  Income
0   1.0   1.0   7.0     8.0     6.5     6.0     3.0
1   2.0   2.0   3.5     3.0     6.5     8.5     6.0
2   3.0   3.0   8.5     8.0     5.0     3.0     7.0
3   4.0   4.0   3.5     3.0     2.0     2.0     8.0
4   5.0   5.0   5.5     8.0     9.0     5.0     4.0
5   6.0   6.0   5.5     3.0     2.0     8.5     9.0
6   7.0   7.0   1.0     8.0     8.0     4.0    10.0
7   8.0   8.0   8.5     3.0     4.0     7.0     5.0
8   9.0   9.0   2.0     8.0     2.0    10.0     2.0
9  10.0  10.0  10.0     3.0    10.0     1.0     1.0

### Basic information about the dataframe
<br>
.shape gives the information about the no. of rows and columns<br>
.columns gives the names of columns. We can assign a list to change the column names<br>
.info gives the basic information about the datafram<br>
.count gives the count of non NULL values in each column

In [65]:
df.shape

(10, 7)

In [66]:
df.columns

Index(['ID', 'Name', 'Age', 'Gender', 'Height', 'Weight', 'Income'], dtype='object')

In [67]:
df.columns=('id','name','age','sex','height(in cm)','weight(in kg)','earning')

In [69]:
df.columns

Index(['id', 'name', 'age', 'sex', 'height(in cm)', 'weight(in kg)',
       'earning'],
      dtype='object')

In [73]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
id               10 non-null int64
name             10 non-null object
age              10 non-null int64
sex              10 non-null object
height(in cm)    10 non-null int64
weight(in kg)    10 non-null int64
earning          10 non-null int64
dtypes: int64(5), object(2)
memory usage: 640.0+ bytes

In [74]:
df.count()

id               10
name             10
age              10
sex              10
height(in cm)    10
weight(in kg)    10
earning          10
dtype: int64

### Aggregate functions
<br>
.sum(), .mean(), .cumsum(), .min(), .max() , .median() are a few aggregation functions available<br>
.describe() gives a summary of the dataframe

In [76]:
df.earning.sum()

583315

In [79]:
df.age.mean()

33.6

In [81]:
df.earning.cumsum()

0     38960
1    113823
2    191079
3    275101
4    317008
5    403206
6    493047
7    541677
8    564294
9    583315
Name: earning, dtype: int64

Note that cumsum() returns a list of

In [75]:
df.describe()

             id        age  height(in cm)  weight(in kg)      earning
count  10.00000  10.000000      10.000000      10.000000     10.00000
mean    5.50000  33.600000     167.900000      71.700000  58331.50000
std     3.02765   7.647803       7.992357       9.877584  27122.76336
min     1.00000  21.000000     158.000000      55.000000  19021.00000
25%     3.25000  29.000000     159.750000      67.500000  39696.75000
50%     5.50000  34.000000     169.000000      71.000000  61746.50000
75%     7.75000  40.000000     174.250000      78.000000  82330.50000
max    10.00000  45.000000     178.000000      90.000000  89841.00000